---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadCombination
source: html/82891124-6fb9-e612-ca8c-6f4e32e2c121.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination

An object that represents a load combination.

## Syntax (C#)
```csharp
public class LoadCombination : Element
```